[
    {
        "id": 200,
        "name": "Dosis Café",
        "type": "cafeteria",
        "address": "Av. Álvaro Obregón 24a, Roma Nte., Cuauhtémoc, 06700 Ciudad de México, CDMX",
        "latitude": 19.41890555328331,
        "longitude": -99.15543663484596,
        "description": "Cafetería de especialidad con ambiente minimalista y relajado. Ideal para leer, trabajar o disfrutar un espresso bien preparado con granos mexicanos seleccionados.",
        "badge": "badge200",
        "specialBadge": "sBadge200"
    },
    {
        "id": 201,
        "name": "Blend Station",
        "type": "cafeteria",
        "address": "Av. Horacio 256, Polanco, Polanco V Secc, Miguel Hidalgo, 11560 Ciudad de México, CDMX",
        "latitude": 19.433412687854304,
        "longitude": -99.18602187779477,
        "description": "Espacio moderno con café de origen y opciones saludables. Perfecto para pasar la mañana con un flat white y pan artesanal.",
        "badge": "badge201",
        "specialBadge": "sBadge201"
    },
    {
        "id": 205,
        "name": "Pujol",
        "type": "restaurante",
        "address": "Tennyson 133, Polanco, Polanco IV Secc, Miguel Hidalgo, 11550 Ciudad de México, CDMX.",
        "latitude": 19.43237248772235,
        "longitude": -99.19483466180543,
        "description": "Restaurante insignia del chef Enrique Olvera, reconocido mundialmente por su reinterpretación de la cocina mexicana con técnicas contemporáneas.",
        "badge": "badge205",
        "specialBadge": "sBadge205"
    },
    {
        "id": 206,
        "name": "Quintonil",
        "type": "restaurante",
        "address": "Av. Isaac Newton 55, Polanco, Polanco IV Secc, Miguel Hidalgo, 11560 Ciudad de México, CDMX",
        "latitude": 19.43083393430477,
        "longitude": -99.19170920582904,
        "description": "Cocina mexicana moderna con ingredientes locales y de temporada. Elegante y con servicio excepcional, ideal para experiencias gastronómicas únicas.",
        "badge": "badge206",
        "specialBadge": "sBadge206"
    },
    {
        "id": 210,
        "name": "Palacio de Bellas Artes",
        "type": "emblematico",
        "address": "Av. Juárez S/N, Centro Histórico, Cuauhtémoc, 06050 Ciudad de México, CDMX.",
        "latitude": 19.435001,
        "longitude": -99.141482,
        "description": "Majestuoso edificio cultural y arquitectónico símbolo de la Ciudad de México. Alberga conciertos, exposiciones y espectáculos de danza.",
        "badge": "badge210",
        "specialBadge": "sBadge210"
    },
    {
        "id": 211,
        "name": "Catedral Metropolitana",
        "type": "emblematico",
        "address": "P.za de la Constitución S/N, Centro Histórico de la Cdad. de México, Centro, Cuauhtémoc, 06000 Ciudad de México, CDMX",
        "latitude": 19.434385904194265,
        "longitude": -99.13308587332332,
        "description": "Principal templo católico del país. Obra maestra del arte virreinal que combina estilos gótico, barroco y neoclásico.",
        "badge": "badge211",
        "specialBadge": "sBadge211"
    },
    {
        "id": 215,
        "name": "Feria Internacional del Libro del Palacio de Minería",
        "type": "evento",
        "address": "Tacuba 5, Centro Histórico, Cuauhtémoc, 06000 Ciudad de México, CDMX.",
        "latitude": 19.43557430858626,
        "longitude": -99.1396499634486,
        "description": "Evento literario anual que reúne editoriales, autores y lectores. Se realiza en uno de los edificios históricos más bellos de la ciudad.",
        "badge": "badge215",
        "specialBadge": "sBadge215"
    },
    {
        "id": 216,
        "name": "Festival de Cine de la Cineteca Nacional",
        "type": "evento",
        "address": "Av. México Coyoacán 389, Xoco, Benito Juárez, 03330 Ciudad de México, CDMX.",
        "latitude": 19.360827892952003,
        "longitude": -99.16382123895728,
        "description": "Festival cinematográfico con proyecciones nacionales e internacionales. Punto de encuentro para amantes del séptimo arte.",
        "badge": "badge216",
        "specialBadge": "sBadge216"
    },
    {
        "id": 220,
        "name": "Cruz Roja Mexicana CDMX",
        "type": "voluntariado",
        "address": "Juan Luis Vives 200, Los Morales, Polanco, Miguel Hidalgo, 11510 Ciudad de México, CDMX.",
        "latitude": 19.437549464449773,
        "longitude": -99.2088450947435,
        "description": "Organización humanitaria que brinda atención médica, rescate y capacitación. Acepta voluntarios en distintas áreas de servicio social.",
        "badge": "badge220",
        "specialBadge": "sBadge220"
    },
    {
        "id": 221,
        "name": "Greenpeace México",
        "type": "voluntariado",
        "address": "Luis Kuhne 55, Águilas, Álvaro Obregón, 01710 Ciudad de México, CDMX",
        "latitude": 19.361531180504713,
        "longitude": -99.20076067336876,
        "description": "Organización ambientalista internacional con sede en CDMX. Ofrece oportunidades de voluntariado en campañas ecológicas y educación ambiental.",
        "badge": "badge221",
        "specialBadge": "sBadge221"
    }
]
